STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_HAP_Peripheral/STM32_WPAN/App/hap_app.c
  return status;
#else /*#if (APP_VCP_ROLE_RENDERER_SUPPORT == 1u)*/
  return HCI_COMMAND_DISALLOWED_ERR_CODE;
#endif
}

uint8_t HAPAPP_VolumeDown(void)
{
#if (APP_VCP_ROLE_RENDERER_SUPPORT == 1u)
  uint8_t status = BLE_STATUS_SUCCESS;
  uint8_t volume;

  if (VCP_Volume > VOLUME_STEP)
  {
    volume = VCP_Volume - VOLUME_STEP;
  }
  else
  {
    LOG_INFO_APP("VCP Volume is at the lowest limit, VCP Mute\n");
    volume = 0;
    status = VCP_RENDER_SetMuteState(1);
    LOG_INFO_APP("VCP_RENDER_SetMuteState() with Mute 1 returns status 0x%02X\n", status);
  }
  if (status == BLE_STATUS_SUCCESS)
  {
    status = VCP_RENDER_SetAbsVolume(volume);
    LOG_INFO_APP("VCP_RENDER_SetAbsVolume() with volume %d returns status 0x%02X\n", volume, status);
  }

  return status;
#else /*#if (APP_VCP_ROLE_RENDERER_SUPPORT == 1u)*/
  return HCI_COMMAND_DISALLOWED_ERR_CODE;
#endif
}

uint8_t HAPAPP_ToggleMute(void)
{
#if (APP_VCP_ROLE_RENDERER_SUPPORT == 1u)
  uint8_t status;
  uint8_t mute;

  mute = (VCP_Mute + 1) % 2;

  status = VCP_RENDER_SetMuteState(mute);
  LOG_INFO_APP("VCP_RENDER_SetMuteState() with Mute State %d returns status 0x%02X\n",mute,status);

  return status;
#else /*#if (APP_VCP_ROLE_RENDERER_SUPPORT == 1u)*/
  return HCI_COMMAND_DISALLOWED_ERR_CODE;
#endif
}

uint8_t HAPAPP_ToggleMicrophoneMute(void)
{
#if (APP_MICP_ROLE_DEVICE_SUPPORT == 1u)
  uint8_t status;

  MicMute = (MicMute + 1) % 2;

  status = MICP_DEVICE_SetMute(MicMute);
  LOG_INFO_APP("MICP_DEVICE_SetMute() with Mute State %d returns status 0x%02X\n",MicMute,status);

  if (status == BLE_STATUS_SUCCESS)
  {
    Menu_SetMicMute(MicMute);
  }

  return status;
#else /*#if (APP_MICP_ROLE_DEVICE_SUPPORT == 1u)*/
  return HCI_COMMAND_DISALLOWED_ERR_CODE;
#endif
}


tBleStatus HAPAPP_NextPreset(void)
{
  tBleStatus status;
  uint8_t new_index = (ActiveIndex % APP_HAP_NUM_PRESETS) + 1;

  status = HAP_HA_SetActivePresetIndex(new_index);
  LOG_INFO_APP("HAP_HA_SetActivePresetIndex() with index %d returns status 0x%02X\n", new_index, status);

  if (status == BLE_STATUS_SUCCESS)
  {
    ActiveIndex = new_index;
    Menu_SetPresetID(ActiveIndex);
    Menu_SetPresetName((char *) aPresetRecord[ActiveIndex-1].Name);
  }
  return status;
}


tBleStatus HAPAPP_PreviousPreset(void)
{
  tBleStatus status;
  uint8_t new_index;

  if (ActiveIndex > 1)
  {
    new_index = ActiveIndex - 1;
  }
  else
  {
    new_index = APP_HAP_NUM_PRESETS;
  }

  status = HAP_HA_SetActivePresetIndex(new_index);
  LOG_INFO_APP("HAP_HA_SetActivePresetIndex() with index %d returns status 0x%02X\n", new_index, status);

  if (status == BLE_STATUS_SUCCESS)
  {
    ActiveIndex = new_index;
    Menu_SetPresetID(ActiveIndex);
    Menu_SetPresetName((char *) &aPresetRecord[ActiveIndex-1].Name[0]);
  }
  return status;
}


tBleStatus HAPAPP_AnswerCall(void)
{
#if (APP_CCP_ROLE_CLIENT_SUPPORT == 1u)

  tBleStatus status = HCI_COMMAND_DISALLOWED_ERR_CODE;
  GAF_Profiles_Link_t current_link;

  for (uint8_t i = 0; i < CFG_BLE_NUM_LINK; i++)
  {
    if (HAPAPP_Context.ACL_Conn[i].Acl_Conn_Handle != 0xFFFFu)
    {
      APP_ACL_Conn_t *p_conn = APP_GetACLConn(HAPAPP_Context.ACL_Conn[i].Acl_Conn_Handle);
      if (p_conn != 0)
      {
        current_link = CAP_GetCurrentLinkedProfiles(p_conn->Acl_Conn_Handle);
        if (((current_link & CCP_LINK) == CCP_LINK) && (p_conn->CurrentCallState == CCP_CS_INCOMING))
        {
          status = CCP_CLIENT_AnswerIncomingCall(p_conn->Acl_Conn_Handle,
                                              p_conn->GenericTelephoneBearerCCID,
                                              p_conn->CurrentCallID);
          if (status != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("  Fail   : CCP_CLIENT_AnswerIncomingCall with ConnHandle 0x%04X and CCID %d - result: 0x%02X\n",
                         p_conn->Acl_Conn_Handle,
                         p_conn->GenericTelephoneBearerCCID,
                         status);
          }
          else
          {
            p_conn->CurrentContentCtrlOp = CCP_CLT_OP_ANSWER_INC_CALL;
            LOG_INFO_APP("  Success: CCP_CLIENT_AnswerIncomingCall with ConnHandle 0x%04X and CCID %d\n",
                         p_conn->Acl_Conn_Handle,
                         p_conn->GenericTelephoneBearerCCID);
            status = BLE_STATUS_SUCCESS;
          }
        }
      }
    }
  }
  return status;
#else /*#if (APP_CCP_ROLE_CLIENT_SUPPORT == 1u)*/
  return HCI_COMMAND_DISALLOWED_ERR_CODE;
#endif
}

tBleStatus HAPAPP_TerminateCall(void)
{
#if (APP_CCP_ROLE_CLIENT_SUPPORT == 1u)

  tBleStatus status = HCI_COMMAND_DISALLOWED_ERR_CODE;
  GAF_Profiles_Link_t current_link;

  for (uint8_t i = 0; i < CFG_BLE_NUM_LINK; i++)
  {
    if (HAPAPP_Context.ACL_Conn[i].Acl_Conn_Handle != 0xFFFFu)
    {
      APP_ACL_Conn_t *p_conn = APP_GetACLConn(HAPAPP_Context.ACL_Conn[i].Acl_Conn_Handle);
      if (p_conn != 0)
      {
        current_link = CAP_GetCurrentLinkedProfiles(p_conn->Acl_Conn_Handle);

        if (((current_link & CCP_LINK) == CCP_LINK) && (p_conn->CurrentCallState != CCP_CS_IDLE))
        {
          status = CCP_CLIENT_TerminateCall(p_conn->Acl_Conn_Handle,
                                            p_conn->GenericTelephoneBearerCCID,
                                            p_conn->CurrentCallID);
          if (status != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("  Fail   : CCP_CLIENT_TerminateCall with ConnHandle 0x%04X and CCID %d - result: 0x%02X\n",
                         p_conn->Acl_Conn_Handle,
                         p_conn->GenericTelephoneBearerCCID,
                         status);
          }
          else
          {
            p_conn->CurrentContentCtrlOp = CCP_CLT_OP_TERMINATE_CALL;
            LOG_INFO_APP("  Success: CCP_CLIENT_TerminateCall with ConnHandle 0x%04X and CCID %d\n",
                         p_conn->Acl_Conn_Handle,
                         p_conn->GenericTelephoneBearerCCID);
          }
        }
      }
    }
  }
  return status;
#else /*#if (APP_CCP_ROLE_CLIENT_SUPPORT == 1u)*/
  return HCI_COMMAND_DISALLOWED_ERR_CODE;
#endif
}

/**
  * @brief The BLE Audio Stack requests to be executed. BLE_AUDIO_STACK_Task() shall be called.
  * @note  If the Host task is executed in a separate thread, the thread shall be unlocked here.
  */
void BLE_AUDIO_STACK_NotifyToRun(void)
{
  APP_NotifyToRun();
}

