STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_HAP_Peripheral/STM32_WPAN/App/hap_app.c
    HAPAPP_Context.aSrcCap[0][4] = 0x02;
    HAPAPP_Context.aSrcCap[0][5] = CODEC_CAP_FRAME_DURATION;
    for (uint8_t i = 0; i < num_src_capabilities ;i++)
    {
      HAPAPP_Context.aSrcCap[0][6] = APP_CodecSpecificCap[a_src_cap_id[i]].FrameDuration;
    }

    HAPAPP_Context.aSrcCap[0][7] = 0x05;
    HAPAPP_Context.aSrcCap[0][8] = CODEC_CAP_OCTETS_PER_CODEC_FRAME;
    for (uint8_t i = 0; i < num_src_capabilities ;i++)
    {
      uint32_t min_octet_per_codec_frame = APP_CodecSpecificCap[a_src_cap_id[i]].MinOctetsPerCodecFrame;
      uint32_t max_octet_per_codec_frame = APP_CodecSpecificCap[a_src_cap_id[i]].MaxOctetsPerCodecFrame;

      if (i > 0)
      {
        min_octet_per_codec_frame = MIN(min_octet_per_codec_frame,
                                        HAPAPP_Context.aSrcCap[0][9] + (HAPAPP_Context.aSrcCap[0][10] << 8));
        max_octet_per_codec_frame = MAX(max_octet_per_codec_frame,
                                        HAPAPP_Context.aSrcCap[0][11] + (HAPAPP_Context.aSrcCap[0][12] << 8));
      }

      HAPAPP_Context.aSrcCap[0][9] = (uint8_t) (min_octet_per_codec_frame);
      HAPAPP_Context.aSrcCap[0][10] = (uint8_t) (min_octet_per_codec_frame >> 8 );
      HAPAPP_Context.aSrcCap[0][11] = (uint8_t) (max_octet_per_codec_frame);
      HAPAPP_Context.aSrcCap[0][12] = (uint8_t) (max_octet_per_codec_frame >> 8);
    }

    HAPAPP_Context.aSrcCap[0][13] = 0x02;
    HAPAPP_Context.aSrcCap[0][14] = CODEC_CAP_AUDIO_CHNL_COUNTS;
    HAPAPP_Context.aSrcCap[0][15] = (APP_MAX_CHANNEL_PER_SRC_ASE | SUPPORTED_AUDIO_CHNL_COUNT_1);

    HAPAPP_Context.aSrcPACRecord[0].Cap.pSpecificCap = &HAPAPP_Context.aSrcCap[0][0];
    HAPAPP_Context.aSrcPACRecord[0].Cap.SpecificCapLength = 16u;

    /* metadata in Audio Codec Configuration*/
    HAPAPP_Context.aSrcPACRecord[0].Cap.MetadataLength = 0x04;
    HAPAPP_Context.aSrcMetadata[0][0] = METADATA_PREFERRED_AUDIO_CONTEXTS_LENGTH;
    HAPAPP_Context.aSrcMetadata[0][1] = METADATA_PREFERRED_AUDIO_CONTEXTS;
    HAPAPP_Context.aSrcMetadata[0][2] = (uint8_t) (AUDIO_CONTEXT_CONVERSATIONAL);
    HAPAPP_Context.aSrcMetadata[0][3] = (uint8_t) (AUDIO_CONTEXT_CONVERSATIONAL >> 8 );
    HAPAPP_Context.aSrcPACRecord[0].Cap.pMetadata = &HAPAPP_Context.aSrcMetadata[0][0];

    status = CAP_RegisterSrcPACRecord(&HAPAPP_Context.aSrcPACRecord[0],&HAPAPP_Context.aSrcPACRecordHandle[0]);
    if (status == BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("Successfully registered Source PAC Record id %d\n",0);
    }
    else
    {
      LOG_INFO_APP("Failed to register Source PAC Record id %d\n",0);
      return status;
    }
#endif /*(APP_NUM_SRC_PAC_RECORDS > 0u)*/
#if (APP_NUM_SRC_ASE >= 1)
#if (APP_CSIP_ROLE_SET_MEMBER_SUPPORT == 0u)
#if (APP_NUM_SRC_ASE == 1 && APP_MAX_CHANNEL_PER_SRC_ASE == 1)
    audio_locations = MONO_AUDIO_LOCATIONS;
#else /* (APP_NUM_SRC_ASE == 1 && APP_MAX_CHANNEL_PER_SRC_ASE == 1) */
    audio_locations = STEREO_AUDIO_LOCATIONS;
#endif /* (APP_NUM_SRC_ASE == 1 && APP_MAX_CHANNEL_PER_SRC_ASE == 1) */
#else /*(APP_CSIP_ROLE_SET_MEMBER_SUPPORT == 1u) */
    if (csip_config_id == 0)
    {
#if (APP_NUM_SRC_ASE == 1 && APP_MAX_CHANNEL_PER_SRC_ASE == 1)
        audio_locations = MONO_AUDIO_LOCATIONS;
#else /* (APP_NUM_SRC_ASE == 1 && APP_MAX_CHANNEL_PER_SRC_ASE == 1) */
        audio_locations = STEREO_AUDIO_LOCATIONS;
#endif /* (APP_NUM_SRC_ASE == 1 && APP_MAX_CHANNEL_PER_SRC_ASE == 1) */
    }
    else
    {
      audio_locations =  (1u << (csip_config_id - 1u));
    }
#endif /*(APP_CSIP_ROLE_SET_MEMBER_SUPPORT == 0u) */
    /*
     * Set the supported Audio Locations, which will be exposed
     * to remote device for reception of audio data
     */
    status = CAP_SetSrcAudioLocations(audio_locations);
    if (status == BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("Successfully set the Supported Source Audio Locations 0x%08X\n",audio_locations);
      HAPAPP_Context.SrcAudioLocations = audio_locations;
    }
    else
    {
      LOG_INFO_APP("Failed to set the Supported Source Audio Locations\n");
      return status;
    }
#endif  /* (APP_NUM_SRC_ASE >= 1) */
  }

  /* Set supported Audio Contexts for reception and transmission */
  status = CAP_SetSupportedAudioContexts(supported_snk_context, supported_src_context);
  if (status == BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("Successfully set the Supported Audio Contexts:\n");
    LOG_INFO_APP("Snk Audio Contexts : 0x%04X\n",supported_snk_context);
    LOG_INFO_APP("Src Audio Contexts : 0x%04X\n",supported_src_context);
    HAPAPP_Context.SupportedSnkAudioContext = supported_snk_context;
    HAPAPP_Context.SupportedSrcAudioContext = supported_src_context;
  }
  else
  {
    LOG_INFO_APP("Failed to set the Supported Audio Contexts\n");
    return status;
  }

  /* Set Available Audio Contexts for reception and transmission */
  status = CAP_SetAvailableAudioContexts(available_snk_context, available_src_context);
  if (status == BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("Successfully set the Available Audio Contexts\n");
    LOG_INFO_APP("Snk Audio Contexts : 0x%04X\n",available_snk_context);
    LOG_INFO_APP("Src Audio Contexts : 0x%04X\n",available_src_context);
    HAPAPP_Context.AvailableSnkAudioContext = available_snk_context;
    HAPAPP_Context.AvailableSrcAudioContext = available_src_context;
  }
  else
  {
    LOG_INFO_APP("Failed to set the Available Audio Contexts\n");
    return status;
  }
  /* Register the Audio Stream Endpoints*/
  status = CAP_RegisterAudioChannels(APP_NUM_SNK_ASE,
                                     APP_NUM_SRC_ASE);
  if (status == BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("Successfully register %ld Sink Audio Stream Endpoints\n", APP_NUM_SNK_ASE);
    LOG_INFO_APP("Successfully register %ld Source Audio Stream Endpoints\n", APP_NUM_SRC_ASE);
    HAPAPP_Context.NumSnkASEs = APP_NUM_SNK_ASE;
    HAPAPP_Context.NumSrcASEs = APP_NUM_SRC_ASE;
  }
  else
  {
    LOG_INFO_APP("Failed to register Audio Channels\n");
    return status;
  }
  /*Register the Task dedicated to retry a Linkup procedure*/
  UTIL_SEQ_RegTask( 1u <<CFG_TASK_APP_LINKUP_RETRY_TIMER_ID, UTIL_SEQ_RFU,APP_LinkupTaskHandler);
  return status;
}

static tBleStatus HAPAPP_HAPInit(HAP_Role_t Role, uint8_t CSIPConfId)
{
  uint8_t status;

  status = USECASE_DEV_MGMT_Init();
  LOG_INFO_APP("Init Usecase Dev Management with status 0x%02X\n", status);
  if (status == BLE_STATUS_SUCCESS)
  {
    status = HAP_Init(Role);
    LOG_INFO_APP("Init HAP with status 0x%02X\n", status);

