STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_HAP_Peripheral/STM32_WPAN/App/hap_app.c
        if (info->CIS_ConnHandle != 0xFFFF)
        {
          for (i = 0; i< APP_MAX_NUM_CIS; i++)
          {
            if (HAPAPP_Context.cis_snk_handle[i] == info->CIS_ConnHandle)
            {
              HAPAPP_Context.cis_snk_handle[i] = 0xFFFFu;
              HAPAPP_Context.num_cis_snk--;
              break;
            }
          }
        }
        if (HAPAPP_Context.num_cis_snk == 0u)
        {
          LOG_INFO_APP("No more Output Audio Data Path is up\n");
          HAPAPP_Context.audio_role_setup &= ~AUDIO_ROLE_SINK;
          LOG_INFO_APP("Stop Tx Audio Peripheral Driver\n");
          Stop_TxAudio();
        }
      }
      break;
    }
    case CAP_CCP_META_EVT:
    {
      CCP_Notification_Evt_t *p_ccp_evt = (CCP_Notification_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("Call Control Meta Event 0x%02X is received on ConnHandle 0x%04X:\n",
                  p_ccp_evt->EvtOpcode,
                  p_ccp_evt->ConnHandle);
#if (APP_CCP_ROLE_CLIENT_SUPPORT == 1u)
      CCP_MetaEvt_Notification(p_ccp_evt);
#endif /*(APP_CCP_ROLE_CLIENT_SUPPORT == 1u)*/
      break;
    }
    case CAP_VCP_META_EVT:
    {
      VCP_Notification_Evt_t *p_vcp_evt = (VCP_Notification_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("Volume Control Meta Event 0x%02X is received on ConnHandle 0x%04X:\n",
                  p_vcp_evt->EvtOpcode,
                  p_vcp_evt->ConnHandle);
#if (APP_VCP_ROLE_RENDERER_SUPPORT == 1u)
      VCP_MetaEvt_Notification(p_vcp_evt);
#endif /*(APP_VCP_ROLE_RENDERER_SUPPORT == 1u)*/
      break;
    }
    case CAP_MICP_META_EVT:
    {
      MICP_Notification_Evt_t *p_micp_evt = (MICP_Notification_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("Microphone Control Meta Event 0x%02X is received on ConnHandle 0x%04X:\n",
                  p_micp_evt->EvtOpcode,
                  p_micp_evt->ConnHandle);
#if (APP_MICP_ROLE_DEVICE_SUPPORT == 1u)
      MICP_MetaEvt_Notification(p_micp_evt);
#endif /*(APP_MICP_ROLE_DEVICE_SUPPORT == 1u)*/
      break;
    }

    case CAP_CCP_LINKUP_EVT:
    {
      APP_ACL_Conn_t *p_conn;
      LOG_INFO_APP("Call Control Profile is linked on ConnHandle 0x%04X\n",pNotification->ConnHandle);
      p_conn = APP_GetACLConn(pNotification->ConnHandle);
      if ((p_conn != 0) && (pNotification->Status == BLE_STATUS_SUCCESS))
      {
        p_conn->AudioProfile |= AUDIO_PROFILE_CCP;
        Menu_SetProfilesLinked(p_conn->AudioProfile);
      }
    }
    break;

    case CAP_CCP_INST_ACTIVATED_EVT:
    {
      CAP_CCP_InstInfo_Evt_t *info = (CAP_CCP_InstInfo_Evt_t *)pNotification->pInfo;
      LOG_INFO_APP("Telephone Bearer Instance with CCID %d is active to control Audio Stream with remote HAP Device (connHandle 0x%04X)\n",
                  info->ContentControlID,
                  pNotification->ConnHandle);
      if (info->FeaturesMask & CCP_FEATURE_BEARER_SIGNAL_STRENGTH)
      {
        LOG_INFO_APP("Bearer Signal Strength ( and associated Signal Strength Reporting Interval) is supported on remote HAP Device\n");
      }
      if (info->FeaturesMask & CCP_FEATURE_INC_CALL_TARGET_BEARER_URI)
      {
        LOG_INFO_APP("Incoming Call Target Bearer URI is supported on remote HAP Device\n");
      }
      if (info->FeaturesMask & CCP_FEATURE_CALL_FRIENDLY_NAME)
      {
        LOG_INFO_APP("Call friendly Name is supported on remote HAP Device\n");
      }
    }
    break;

    case CAP_CCP_INST_DEACTIVATED_EVT:
    {
      uint8_t *ccid = (uint8_t *)pNotification->pInfo;
      LOG_INFO_APP("Telephone Bearer Instance with CCID %d is no more associated to Audio Stream with remote HAP Device (connection handle 0x%04X)\n",
                  *ccid,
                  pNotification->ConnHandle);
      UNUSED(ccid);
    }
    break;

    default:
      break;
  }
}
static void LinkupRetry_TimerCallback(void *arg)
{
  UTIL_SEQ_SetTask(1U << CFG_TASK_APP_LINKUP_RETRY_TIMER_ID, CFG_SEQ_PRIO_0);
}
static void APP_LinkupTaskHandler(void)
{
  tBleStatus status;
  LOG_INFO_APP("Retry to perfom Linkup with a remote connected device\n");
  for (uint8_t conn = 0; conn < CFG_BLE_NUM_LINK ; conn++)
  {
    if ( HAPAPP_Context.ACL_Conn[conn].LinkupRetry == 1u)
    {
      /*Update LinkupRetry flag to indicate that Linkup retry has been handled*/
      HAPAPP_Context.ACL_Conn[conn].LinkupRetry = 0xFFu;
      status = HAPAPP_Linkup(HAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle);
      if (status == BLE_STATUS_SUCCESS)
      {
        return;
      }
    }
  }
}

static uint8_t HAPAPP_BuildAdvDataPacket(uint8_t *pAdvData,
                                         uint8_t *AdvPacketLen,
                                         CAP_Announcement_t AnnouncementType,
                                         uint8_t EnableSolicitationRequest,
                                         uint16_t Appearance)
{
  *AdvPacketLen = HAP_HA_BuildAdvPacket(AnnouncementType,
                                        (void*)0u,
                                        0u,
                                        Appearance,
                                        &pAdvData[0],
                                        (CAP_ADV_DATA_LEN+HAP_ADV_DATA_LEN));

  if (*AdvPacketLen > 0u)
  {
    uint8_t i;
    LOG_INFO_APP("CAP Advertising Packet (Length : %d) :\n",(*AdvPacketLen));
    for (i = 0u; i < (*AdvPacketLen) ; i++)
    {
      LOG_INFO_APP("0x%02X ",pAdvData[i]);
    }
    LOG_INFO_APP("\n");
    return BLE_STATUS_SUCCESS;
  }
  else
  {
    LOG_INFO_APP("Error to build Advertising Packet by CAP\n");
    return BLE_STATUS_ERROR;
  }
}

static void APP_ParseMetadataParams(APP_ASE_Info_t *pASE,
                                    uint16_t ConnHandle,
                                    uint8_t const *pMetadata,
                                    uint8_t MetadataLength)
{
  uint8_t status;
  Audio_Context_t audio_context = 0x0000;
  Audio_Context_t snk_context = 0x0000;
  Audio_Context_t src_context = 0x0000;
  Audio_Context_t available_snk_context = 0x0000;
  Audio_Context_t available_src_context = 0x0000;
  APP_ACL_Conn_t *p_conn = APP_GetACLConn(ConnHandle);
  LOG_INFO_APP("Parse Metadata of ASE ID 0x%02X (Type 0x%02X) in state 0x%02X on ConnHandle 0x%04X\n",
               pASE->ID,
               pASE->type,
               pASE->state,
               ConnHandle);
  if (p_conn != 0)
  {
    status = LTV_GetStreamingAudioContexts((uint8_t *)pMetadata,MetadataLength,&audio_context);
    if(status == 1u)
    {
      LOG_INFO_APP("ASE ID 0x%02X on ConnHandle 0x%04X is associated to a Streaming Audio Contexts 0x%04X\n",
                   pASE->ID,
                   ConnHandle,
                   audio_context);
      /*update available audio contexts in case of streaming audio contexts associated to the ASE has changed*/
      if (pASE->streaming_audio_context != audio_context)
      {
        LOG_INFO_APP("ASE ID 0x%02X on ConnHandle 0x%04X was previously associated to a Streaming Audio Contexts 0x%04X\n",
                   pASE->ID,
                   ConnHandle,
                   pASE->streaming_audio_context);
        /* Release the Streaming Audio Contexts previously associated to the ASE to calculate resulting
         * new available audio contexts in compliance with other ASEs in ENABLING or STREAMING state
         */
        if (pASE->type == ASE_SINK)
        {
          if ( pASE->streaming_audio_context != 0x0000u)
          {
            snk_context = APP_ReleasedASEStreamingAudioContexts(p_conn,
                                                                pASE,
                                                                pASE->streaming_audio_context);
          }
        }
        else
        {
          if ( pASE->streaming_audio_context != 0x0000u)
          {
            src_context = APP_ReleasedASEStreamingAudioContexts(p_conn,
                                                                pASE,
                                                                pASE->streaming_audio_context);
          }
        }
        /* if context are now available, update them */
        available_snk_context = HAPAPP_Context.AvailableSnkAudioContext | snk_context;
        available_src_context = HAPAPP_Context.AvailableSrcAudioContext | src_context;

        /* now it's time to update the available audio contexts according to the new streaming audio context
         * of the specified ASE
         */
        pASE->streaming_audio_context = audio_context;

