STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_HAP_Peripheral/STM32_WPAN/App/hap_app.c
        /* Set audio contexts to removed from availability according to the streaming audio contexts associated to the
         * ASE.
         */
        if (pASE->type == ASE_SINK)
        {
          /* Remove the contexts which are not available according to Streaming Audio contexts of the ASE */
          available_snk_context = APP_UnavailableAudioContexts(pASE->type,available_snk_context,audio_context);
        }
        else /*(p_info->type & ASE_SOURCE)*/
        {
          /* Remove the contexts which are not available according to Streaming Audio contexts of the ASE */
          available_src_context = APP_UnavailableAudioContexts(ASE_SOURCE,available_src_context,audio_context);
        }
        LOG_INFO_APP("Previous Available Contexts are : Snk 0x%04X  - Src  0x%04X\n",
                     HAPAPP_Context.AvailableSnkAudioContext,
                     HAPAPP_Context.AvailableSrcAudioContext);
        LOG_INFO_APP("Calculated New Available Contexts are : Snk 0x%04X  - Src  0x%04X\n",
                     available_snk_context,
                     available_src_context);

        /*Set new available audio contexts for BAP Annoucement*/
        status = CAP_SetAvailableAudioContexts(available_snk_context,available_src_context);
        if (status == BLE_STATUS_SUCCESS)
        {
          if (pASE->type == ASE_SINK)
          {
            HAPAPP_Context.AvailableSnkAudioContext = available_snk_context;
          }
          else /*(p_info->type & ASE_SOURCE)*/
          {
            HAPAPP_Context.AvailableSrcAudioContext = available_src_context;
          }
          LOG_INFO_APP("Set Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X\n",
                       HAPAPP_Context.AvailableSnkAudioContext,
                       HAPAPP_Context.AvailableSrcAudioContext);
        }
        else
        {
          LOG_INFO_APP("FAILURE to Set Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X\n",
                       available_snk_context,
                       available_src_context);
        }

        if (HAPAPP_Context.NumConn > 1u )
        {
          if ((p_conn->AvailableSnkAudioContext != SUPPORTED_SNK_CONTEXTS) \
              || (p_conn->AvailableSrcAudioContext != SUPPORTED_SRC_CONTEXTS))
          {
            /*update the available Audio Contexts of the CAP Initiator requesting the enable operation*/
            status = CAP_UpdateAvailableAudioContexts(ConnHandle,
                                                      SUPPORTED_SNK_CONTEXTS,
                                                      SUPPORTED_SRC_CONTEXTS);
            LOG_INFO_APP("Send Update Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X with CAP Initiator on ConnHandle 0x%04X returns status 0x%02X\n",
                         SUPPORTED_SNK_CONTEXTS,
                         SUPPORTED_SRC_CONTEXTS,
                         ConnHandle,
                         status);
            p_conn->AvailableSnkAudioContext = SUPPORTED_SNK_CONTEXTS;
            p_conn->AvailableSrcAudioContext = SUPPORTED_SRC_CONTEXTS;
          }
          else
          {
            LOG_INFO_APP("Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X with CAP Initiator on ConnHandle 0x%04X haven't changed\n",
                         SUPPORTED_SNK_CONTEXTS,
                         SUPPORTED_SRC_CONTEXTS,
                         ConnHandle);
          }

          for (uint8_t conn = 0u; conn < CFG_BLE_NUM_LINK ; conn++)
          {
            if ((HAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle != 0xFFFFu) && (&HAPAPP_Context.ACL_Conn[conn] != p_conn))
            {
              if ((HAPAPP_Context.ACL_Conn[conn].AvailableSnkAudioContext != HAPAPP_Context.AvailableSnkAudioContext) \
                  || (HAPAPP_Context.ACL_Conn[conn].AvailableSrcAudioContext != HAPAPP_Context.AvailableSrcAudioContext))
              {
                /* we update the Audio Contexts availablity to other connected CAP Initiators */
                status = CAP_UpdateAvailableAudioContexts(HAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle,
                                                          HAPAPP_Context.AvailableSnkAudioContext,
                                                          HAPAPP_Context.AvailableSrcAudioContext);
                LOG_INFO_APP("Send Update Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X with CAP Initiator on ConnHandle 0x%04X returns status 0x%02X\n",
                             HAPAPP_Context.AvailableSnkAudioContext,
                             HAPAPP_Context.AvailableSrcAudioContext,
                             HAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle,
                             status);
                HAPAPP_Context.ACL_Conn[conn].AvailableSnkAudioContext = HAPAPP_Context.AvailableSnkAudioContext;
                HAPAPP_Context.ACL_Conn[conn].AvailableSrcAudioContext = HAPAPP_Context.AvailableSrcAudioContext;
              }
              else
              {
                LOG_INFO_APP("Available Snk Audio Contexts 0x%04X and Available Src Audio Contexts 0x%04X with CAP Initiator on ConnHandle 0x%04X haven't changed\n",
                             HAPAPP_Context.AvailableSnkAudioContext,
                             HAPAPP_Context.AvailableSrcAudioContext,
                             HAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle);
              }
            }
          }
        }
        if (HAPAPP_Context.NumConn < CFG_BLE_NUM_LINK )
        {
          HAPAPP_StopAdvertising();
          /* Start Advertising */
#if (CFG_LOG_SUPPORTED != 0)
          status =
#endif /*(CFG_LOG_SUPPORTED != 0)*/
          HAPAPP_StartAdvertising(CAP_GENERAL_ANNOUNCEMENT, 0, GAP_APPEARANCE_GENERIC_HEARING_AID);
          LOG_INFO_APP("HAPAPP_StartAdvertising() returns status 0x%02X\n",status);
        }
      }

    }

    status = LTV_GetPreferredAudioContexts((uint8_t *)pMetadata,MetadataLength,&audio_context);
    if(status == 1u)
    {
      LOG_INFO_APP("ASE ID 0x%02X on ConnHandle 0x%04X is associated to a Preferred Audio Contexts 0x%04X\n",
                   pASE->ID,
                   ConnHandle,
                   audio_context);
    }
  }
}

/* Update the available audio contextsaccording to a Audio Contexts in use
 * Return new available audio contexts
*/
static uint16_t APP_UnavailableAudioContexts(ASE_Type_t Type,
                                             Audio_Context_t AvailableAudioContext,
                                             Audio_Context_t AudioContexts)
{
  Audio_Context_t res_audio_contexts = AvailableAudioContext;
  if (Type == ASE_SINK)
  {
    /* Remove the contexts which are not available according to Streaming Audio contexts of the other ASEs */
    if (AudioContexts & AUDIO_CONTEXT_MEDIA)
    {
      /*If Audio Contexts includes Media type :  Media, Alerts and Unspecified Contexts would be no more available*/
      res_audio_contexts &= ( ~(AUDIO_CONTEXT_MEDIA | AUDIO_CONTEXT_UNSPECIFIED | AUDIO_CONTEXT_ALERTS ));
    }
    if (AudioContexts & AUDIO_CONTEXT_ALERTS)
    {
      /*If Audio Contexts includes Alerts type :  Media, Alerts and Unspecified Contexts would be no more available*/
      res_audio_contexts &= ( ~(AUDIO_CONTEXT_ALERTS | AUDIO_CONTEXT_UNSPECIFIED | AUDIO_CONTEXT_MEDIA ));
    }
    if (AudioContexts & AUDIO_CONTEXT_RINGTONE)
    {
      /*If Audio Contexts includes RingTone type :  Ringtone, Media, Alerts and Unspecified Contexts would be no more available*/
      res_audio_contexts &= ( ~(AUDIO_CONTEXT_RINGTONE | AUDIO_CONTEXT_UNSPECIFIED | AUDIO_CONTEXT_MEDIA | AUDIO_CONTEXT_ALERTS ));
    }
    if (AudioContexts & AUDIO_CONTEXT_CONVERSATIONAL)
    {
      /*If Audio Contexts includes Conversational type :  Conversational still available but Ringtone, Media, Alerts and Unspecified Contexts would no more available*/
      res_audio_contexts &= ( ~(AUDIO_CONTEXT_UNSPECIFIED | AUDIO_CONTEXT_RINGTONE | AUDIO_CONTEXT_MEDIA | AUDIO_CONTEXT_ALERTS ));
    }
  }
  else
  {
    if (AudioContexts & AUDIO_CONTEXT_CONVERSATIONAL)
    {
      /*If Audio Contexts includes Conversational type :  Conversational still available but Unspecified Context would no more available*/
      res_audio_contexts &= ( ~(AUDIO_CONTEXT_UNSPECIFIED));
    }
  }
  return res_audio_contexts;
}
/* Release the Streaming Audio Contexts associated to an ASE to update the available audio contexts
 * and return new available audio contexts
*/
static uint16_t APP_ReleasedASEStreamingAudioContexts(APP_ACL_Conn_t *pConn,APP_ASE_Info_t *pASE, uint16_t AudioContexts)
{
  Audio_Context_t available_context = 0;
  Audio_Context_t use_context = 0;

  /* Check if potential removed Audio Contexts is also associated to an Enabling/streaming ASE in order to
   * check if it would be available or not
   */
#if (APP_NUM_SNK_ASE > 0u)
  if (pASE->type == ASE_SINK)
  {
    available_context = AudioContexts;
    for (uint8_t conn = 0u; conn < CFG_BLE_NUM_LINK ; conn++)
    {
      if (HAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle != 0xFFFFu)
      {
        for ( uint8_t i = 0; i < HAPAPP_Context.NumSnkASEs;i++)
        {
          if ((HAPAPP_Context.ACL_Conn[conn].pASEs->aSnkASE[i].allocated == 1) \
              && (&HAPAPP_Context.ACL_Conn[conn].pASEs->aSnkASE[i] != pASE))
          {
            if ((HAPAPP_Context.ACL_Conn[conn].pASEs->aSnkASE[i].state == ASE_STATE_ENABLING) \
              || (HAPAPP_Context.ACL_Conn[conn].pASEs->aSnkASE[i].state == ASE_STATE_STREAMING))
            {
              use_context |= HAPAPP_Context.ACL_Conn[conn].pASEs->aSnkASE[i].streaming_audio_context;
              available_context &= ~HAPAPP_Context.ACL_Conn[conn].pASEs->aSnkASE[i].streaming_audio_context;
              LOG_INFO_APP("Streaming Audio Contexts 0x%04X associated to ASE ID %d on ConnHandle 0x%04X still in use\n",
                           HAPAPP_Context.ACL_Conn[conn].pASEs->aSnkASE[i].streaming_audio_context,
                           HAPAPP_Context.ACL_Conn[conn].pASEs->aSnkASE[i].ID,
                           HAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle);
            }
          }
        }
      }
    }
    /* if audio contexts are now available, update them because if audio contexts are released, other audio contexts
     * become also available
     */
    if (available_context != 0x0000)
    {
      if (available_context & AUDIO_CONTEXT_MEDIA)
      {
        available_context |= (AUDIO_CONTEXT_CONVERSATIONAL | AUDIO_CONTEXT_MEDIA | \
                              AUDIO_CONTEXT_ALERTS | AUDIO_CONTEXT_RINGTONE);
      }
      if (available_context & AUDIO_CONTEXT_ALERTS)
      {
        available_context |= (AUDIO_CONTEXT_CONVERSATIONAL | AUDIO_CONTEXT_MEDIA | \
                              AUDIO_CONTEXT_ALERTS | AUDIO_CONTEXT_RINGTONE);
      }
      if (available_context & AUDIO_CONTEXT_RINGTONE)
      {
        available_context |= (AUDIO_CONTEXT_CONVERSATIONAL | AUDIO_CONTEXT_MEDIA | \
                              AUDIO_CONTEXT_ALERTS | AUDIO_CONTEXT_RINGTONE);
      }
      if (available_context & AUDIO_CONTEXT_CONVERSATIONAL)
      {
        available_context |= (AUDIO_CONTEXT_CONVERSATIONAL | AUDIO_CONTEXT_MEDIA | \
                              AUDIO_CONTEXT_ALERTS | AUDIO_CONTEXT_RINGTONE);
      }
      /* Remove the contexts which are not available according to Streaming Audio contexts of the other ASEs */
      available_context = APP_UnavailableAudioContexts(ASE_SINK,available_context,use_context);
      if (available_context != 0x0000)
      {
        LOG_INFO_APP("Add Audio Contexts 0x%04X to Available Snk Audio Contexts 0x%04X\n",
                     available_context,
                     HAPAPP_Context.AvailableSnkAudioContext);
      }
    }
  }
#endif /* (APP_NUM_SNK_ASE > 0u) */
#if (APP_NUM_SRC_ASE > 0u)
  if (pASE->type == ASE_SOURCE)
  {
    available_context = AudioContexts;
    for (uint8_t conn = 0u; conn < CFG_BLE_NUM_LINK ; conn++)
    {
      if (HAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle != 0xFFFFu)
      {
        for ( uint8_t i = 0; i < HAPAPP_Context.NumSrcASEs;i++)
        {
          if ((HAPAPP_Context.ACL_Conn[conn].pASEs->aSrcASE[i].allocated == 1) \
              && (&HAPAPP_Context.ACL_Conn[conn].pASEs->aSrcASE[i] != pASE))
          {
            if ((HAPAPP_Context.ACL_Conn[conn].pASEs->aSrcASE[i].state == ASE_STATE_ENABLING) \
              || (HAPAPP_Context.ACL_Conn[conn].pASEs->aSrcASE[i].state == ASE_STATE_STREAMING))
            {
              use_context |= HAPAPP_Context.ACL_Conn[conn].pASEs->aSrcASE[i].streaming_audio_context;
              available_context &= ~HAPAPP_Context.ACL_Conn[conn].pASEs->aSrcASE[i].streaming_audio_context;
              LOG_INFO_APP("Streaming Audio Contexts 0x%04X associated to ASE ID %d on ConnHandle 0x%04X still in use\n",
                           HAPAPP_Context.ACL_Conn[conn].pASEs->aSrcASE[i].streaming_audio_context,
                           HAPAPP_Context.ACL_Conn[conn].pASEs->aSrcASE[i].ID,
                           HAPAPP_Context.ACL_Conn[conn].Acl_Conn_Handle);
            }
          }
        }
      }
    }
    /* Remove the contexts which are not available according to Streaming Audio contexts of the other ASEs */
    available_context = APP_UnavailableAudioContexts(ASE_SOURCE,available_context,use_context);
    if (available_context != 0x0000)
    {
      LOG_INFO_APP("Add Audio Contexts 0x%04X to Available Src Audio Contexts 0x%04X\n",
                   available_context,
                   HAPAPP_Context.AvailableSrcAudioContext);
    }
  }
#endif /* (APP_NUM_SRC_ASE > 0u) */

